code/openfoam/tutorials/multiphaseEuler/condenser/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phaseTurbulenceStabilisationGas
{
    type    phaseTurbulenceStabilisation;

    libs    ("libmultiphaseEulerFvModels.so");

    phase   gas;

    alphaInversion  0.1;
}

phaseTurbulenceStabilisationLiquid
{
    type    phaseTurbulenceStabilisation;

    libs    ("libmultiphaseEulerFoamFvModels.so");

    phase   liquid;

    alphaInversion  0.1;
}

wallCondensation
{
    type            wallCondensation;
    libs            ("libmultiphaseEulerFvModels.so");

    phases          (gas liquid);

    specie          H2O;

    energySemiImplicit yes;
    specieSemiImplicit no;

    saturationPressure
    {
        type            ArdenBuck;
    }
}

solidCondensation
{
    type            phaseSurfaceCondensation;
    libs            ("libmultiphaseEulerFvModels.so");

    phase           solid;
    phases          (gas liquid);

    specie          H2O;

    energySemiImplicit yes;
    specieSemiImplicit no;

    diffusiveMassTransfer
    {
        solid_dispersedIn_gas_inThe_gas
        {
            type            Frossling;
            Le              0.85;
        }
    }

    saturationPressure
    {
        type            ArdenBuck;
    }
}

// ************************************************************************* //
