code/openfoam/tutorials/multiphaseEuler/condenser/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
    (0 0 0)
    (1.4 0 0)
    (1.4 0.2 0)
    (0 0.2 0)

    (0 0 0.2)
    (1.4 0 0.2)
    (1.4 0.2 0.2)
    (0 0.2 0.2)

    (0.4 0 0)
    (0.6 0 0)
    (0.6 0 0.2)
    (0.4 0 0.2)

    (0.4 -0.3 0)
    (0.6 -0.3 0)
    (0.6 -0.3 0.2)
    (0.4 -0.3 0.2)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (70 10 10) simpleGrading (1 1 1)
    hex (8 9 10 11 12 13 14 15) (10 10 10) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
            (2 3 7 6)

            (8 9 13 12)
            (11 10 14 15)
            (8 11 15 12)
            (9 13 14 10)

            (12 13 14 15)
        );
    }
    wall_bottom
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    inlet_bottom
    {
        type patch;
        faces
        (
            (8 9 10 11)
        );
    }
);

mergePatchPairs
(
    (wall_bottom inlet_bottom)
);

// ************************************************************************* //
